xtee6/asicverifier/src/test/resources/asic-containers/invalid-hashchain-modified-message/message.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xroad="http://x-road.eu/xsd/xroad.xsd"
        xmlns:id="http://x-road.eu/xsd/identifiers">
    <SOAP-ENV:Header>
        <xroad:client id:objectType="MEMBER">
            <id:xRoadInstance>EE</id:xRoadInstance>
            <id:memberClass>BUSINESS</id:memberClass>
            <id:memberCode>consumer</id:memberCode>
        </xroad:client>
        <xroad:service id:objectType="SERVICE">
            <id:xRoadInstance>EE</id:xRoadInstance>
            <id:memberClass>BUSINESS</id:memberClass>
            <id:memberCode>producer</id:memberCode>
            <id:serviceCode>test</id:serviceCode>
        </xroad:service>
        <xroad:userId>EE37702211234</xroad:userId>
        <xroad:id>7113f3a6e47b76a91055d9d9a9ccaa87</xroad:id>
        <xroad:issue>issue</xroad:issue>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:test xmlns:ns1="http://cosumer.ee.xroad.net">I am hacked</ns1:test>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
